MikroElektronika/core_packages/PIC/XC8/def/PIC18F63J11/mcu.h
extern volatile RCREGbits_t RCREGbits __at(0xFD0);
// bitfield macros
#define _RCREG_NOT_BOR_POSN                                 0x0
#define _RCREG_NOT_BOR_POSITION                             0x0
#define _RCREG_NOT_BOR_SIZE                                 0x1
#define _RCREG_NOT_BOR_LENGTH                               0x1
#define _RCREG_NOT_BOR_MASK                                 0x1
#define _RCREG_NOT_POR_POSN                                 0x1
#define _RCREG_NOT_POR_POSITION                             0x1
#define _RCREG_NOT_POR_SIZE                                 0x1
#define _RCREG_NOT_POR_LENGTH                               0x1
#define _RCREG_NOT_POR_MASK                                 0x2
#define _RCREG_NOT_PD_POSN                                  0x2
#define _RCREG_NOT_PD_POSITION                              0x2
#define _RCREG_NOT_PD_SIZE                                  0x1
#define _RCREG_NOT_PD_LENGTH                                0x1
#define _RCREG_NOT_PD_MASK                                  0x4
#define _RCREG_NOT_TO_POSN                                  0x3
#define _RCREG_NOT_TO_POSITION                              0x3
#define _RCREG_NOT_TO_SIZE                                  0x1
#define _RCREG_NOT_TO_LENGTH                                0x1
#define _RCREG_NOT_TO_MASK                                  0x8
#define _RCREG_NOT_RI_POSN                                  0x4
#define _RCREG_NOT_RI_POSITION                              0x4
#define _RCREG_NOT_RI_SIZE                                  0x1
#define _RCREG_NOT_RI_LENGTH                                0x1
#define _RCREG_NOT_RI_MASK                                  0x10
#define _RCREG_NOT_CM_POSN                                  0x5
#define _RCREG_NOT_CM_POSITION                              0x5
#define _RCREG_NOT_CM_SIZE                                  0x1
#define _RCREG_NOT_CM_LENGTH                                0x1
#define _RCREG_NOT_CM_MASK                                  0x20
#define _RCREG_nBOR_POSN                                    0x0
#define _RCREG_nBOR_POSITION                                0x0
#define _RCREG_nBOR_SIZE                                    0x1
#define _RCREG_nBOR_LENGTH                                  0x1
#define _RCREG_nBOR_MASK                                    0x1
#define _RCREG_nPOR_POSN                                    0x1
#define _RCREG_nPOR_POSITION                                0x1
#define _RCREG_nPOR_SIZE                                    0x1
#define _RCREG_nPOR_LENGTH                                  0x1
#define _RCREG_nPOR_MASK                                    0x2
#define _RCREG_nPD_POSN                                     0x2
#define _RCREG_nPD_POSITION                                 0x2
#define _RCREG_nPD_SIZE                                     0x1
#define _RCREG_nPD_LENGTH                                   0x1
#define _RCREG_nPD_MASK                                     0x4
#define _RCREG_nTO_POSN                                     0x3
#define _RCREG_nTO_POSITION                                 0x3
#define _RCREG_nTO_SIZE                                     0x1
#define _RCREG_nTO_LENGTH                                   0x1
#define _RCREG_nTO_MASK                                     0x8
#define _RCREG_nRI_POSN                                     0x4
#define _RCREG_nRI_POSITION                                 0x4
#define _RCREG_nRI_SIZE                                     0x1
#define _RCREG_nRI_LENGTH                                   0x1
#define _RCREG_nRI_MASK                                     0x10
#define _RCREG_nCM_POSN                                     0x5
#define _RCREG_nCM_POSITION                                 0x5
#define _RCREG_nCM_SIZE                                     0x1
#define _RCREG_nCM_LENGTH                                   0x1
#define _RCREG_nCM_MASK                                     0x20
#define _RCREG_IPEN_POSN                                    0x7
#define _RCREG_IPEN_POSITION                                0x7
#define _RCREG_IPEN_SIZE                                    0x1
#define _RCREG_IPEN_LENGTH                                  0x1
#define _RCREG_IPEN_MASK                                    0x80
#define _RCREG_BOR_POSN                                     0x0
#define _RCREG_BOR_POSITION                                 0x0
#define _RCREG_BOR_SIZE                                     0x1
#define _RCREG_BOR_LENGTH                                   0x1
#define _RCREG_BOR_MASK                                     0x1
#define _RCREG_POR_POSN                                     0x1
#define _RCREG_POR_POSITION                                 0x1
#define _RCREG_POR_SIZE                                     0x1
#define _RCREG_POR_LENGTH                                   0x1
#define _RCREG_POR_MASK                                     0x2
#define _RCREG_PD_POSN                                      0x2
#define _RCREG_PD_POSITION                                  0x2
#define _RCREG_PD_SIZE                                      0x1
#define _RCREG_PD_LENGTH                                    0x1
#define _RCREG_PD_MASK                                      0x4
#define _RCREG_TO_POSN                                      0x3
#define _RCREG_TO_POSITION                                  0x3
#define _RCREG_TO_SIZE                                      0x1
#define _RCREG_TO_LENGTH                                    0x1
#define _RCREG_TO_MASK                                      0x8
#define _RCREG_RI_POSN                                      0x4
#define _RCREG_RI_POSITION                                  0x4
#define _RCREG_RI_SIZE                                      0x1
#define _RCREG_RI_LENGTH                                    0x1
#define _RCREG_RI_MASK                                      0x10
#define _RCREG_CM_POSN                                      0x5
#define _RCREG_CM_POSITION                                  0x5
#define _RCREG_CM_SIZE                                      0x1
#define _RCREG_CM_LENGTH                                    0x1
#define _RCREG_CM_MASK                                      0x20

// Register: WDTCON
#define WDTCON WDTCON
extern volatile unsigned char           WDTCON              __at(0xFD1);
#ifndef _LIB_BUILD
asm("WDTCON equ 0FD1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWDTEN                 :1;
        unsigned                        :6;
        unsigned REGSLP                 :1;
    };
    struct {
        unsigned SWDTE                  :1;
    };
} WDTCONbits_t;
